console.log("variable");
//변수(데이터를 저장하고 참조(사용)하는 데이터의 이름)
// var(사용안함), let, const

// 재사용이 가능
// 변수 선언
const a = 3;
let b = 5;

console.log(a + b);
console.log(a - b);
console.log(a * b);
console.log(a / b);

//--------------------------------------------------------------------

//값(데이터)의 재할당 가능
let c = 4;
console.log(c);

c = 40;
console.log(c);
// let 선언은 재할당이 가능

const d = 5;
console.log(d);

// d = 50;
// console.log(d);
// const 선언은 재할당이 안됨

//--------------------------------------------------------------------
//--------------------------------------------------------------------
//--------------------------------------------------------------------

console.log("Reserved");
// 예약어(Reserved Word)(특별한 의미를 가지고 있어, 변수나 함수 이름 등으로 사용할 수 없는 단어)

// this

//--------------------------------------------------------------------

// if

//--------------------------------------------------------------------

// break
